#!/usr/bin/env python
# coding: utf-8

# In[ ]:


'''Задача 48
Собственные степени
Сумма 1^1 + 2^2 + 3^3 + ... + 10^10 = 10405071317.

Найдите последние десять цифр суммы 1^1 + 2^2 + 3^3 + ... + 1000^1000.
'''


# In[1]:


# Решение
t = 0
for i in range(1, 10 ** 3 + 1):
    t += i ** i
print(str(t)[-10:])


# In[4]:


print(str(sum( i ** i for i in range(1, 10 ** 3 + 1)))[-10:])


# In[ ]:




